ox_docs/corners/david/ml-alphafold.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-24 Fri 14:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>AlphaFold</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Taproot" />
<link rel="stylesheet" href="https://taproot3.sanity.gq/global.css" type="text/css"/>
<link rel="stylesheet" href="https://raw.githubusercontent.com/PrismJS/prism-themes/master/themes/prism-atom-dark.css" crossorigin="anonymous" referrerpolicy="no-referrer" />
</head>
<body>
<div id="preamble" class="status">
<div>AlphaFold  Taproot 2021-09-24 Fri 13:59</div>
</div>
<div id="content">
<h1 class="title">AlphaFold</h1>
<p>
<a href="https://www.nature.com/articles/s41586-019-1923-7.epdf?author_access_token=Z_KaZKDqtKzbE7Wd5HtwI9RgN0jAjWel9jnR3ZoTv0MCcgAwHMgRx9mvLjNQdB2TlQQaa7l420UCtGo8vYQ39gg8lFWR9mAZtvsN_1PrccXfIbc6e-tGSgazNL_XdtQzn1PHfy21qdcxV7Pw-k3htw%3D%3D">https://www.nature.com/articles/s41586-019-1923-7.epdf?author_access_token=Z_KaZKDqtKzbE7Wd5HtwI9RgN0jAjWel9jnR3ZoTv0MCcgAwHMgRx9mvLjNQdB2TlQQaa7l420UCtGo8vYQ39gg8lFWR9mAZtvsN_1PrccXfIbc6e-tGSgazNL_XdtQzn1PHfy21qdcxV7Pw-k3htw%3D%3D</a>
</p>

<p>
AlphaFold is Google DeepMind's protein structure prediction software that uses deep learning to minimize energy potential by modifying torsion angles. 
</p>

<p>
AlphaFold's primary component is a CNN trained off of protein samples to predict distances between atoms within pairs of residues of a protein. Given an amino acid sequence, it produces a discrete  probability distribution for every residue pair within a 64 by 64 area in the distance matrix. These local predictions can be combined to create a full set of predictions and a distance histogram (a matrix view of the distances between any two residues). 
<i>SIDENOTE: Network also outputs confidence for each prediction</i>
</p>

<p>
Proteins were parameterized via torsion angles of each residue the coordinates for structure were generated via "differential models of protein geometry".
</p>

<div id="outline-container-orgfc58162" class="outline-2">
<h2 id="orgfc58162"><span class="section-number-2">1</span> Hyperparameters/Details</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="20200830155543-dropout.html">Dropout</a> (keep prob 0.85)</li>
<li><a href="20200830155521-parallelized_sgd.html">Parallelized SGD</a> (batch sz 4)</li>
<li>Activation function: ELU</li>
<li>Learning rate: 0.06</li>
<li>Learning rate decay (halved at 150000, 200000, 250000, 350000 steps)</li>
<li>5 days training time</li>
</ul>
</div>
</div>
</div>
</body>
</html>
